  # Variables: هو صندوق نخزن فيه قيمة(رقم،نص).
  # for example:
age = 20
print ("your age =",age)
 #تعريف منغير يحتوي على عدد صحيح
"""
قواعد كتابة المتغيرات :
* يفضل تسمية المخزن (المتغير)  باسم يدل على الشيء المخزن فيه ليسهيل على المستخدم التعرف على المتغير أو المعلومة
* لا يجوز أن يبدأ اسم المتغير برقم (يمكن كتابة رقم في أي مكان(المنتصف ،النهاية) إلا في البداية لا يجوز 
* يجب أن لا يحتوي المتغير على فراغات فمثلاً لكتابة متغير يتكون من كلمتين لايجوز وضع فراغ بينهما ويفضل كتابتهما باحدى الطريقتين :
* Studant_name
* StudentName

"""