# Loops (الحلقات):
"""
تعمل على تكرار الكود أكثر من مرة دون الحاجة الى كتابته في كل مرة فمثلا 
لو أردنا طباعة الاعداد من 0-100 بلا من كتابة 
مئة مرة نستخدم حلقة التكرار  print 
Loop
"""
"""
أنواع الحلقات في لغة 
python:
1. for loop – نستخدمها لما نعرف عدد التكرارات.


2. while loop – نستخدمها لما ما نعرف كم مرة رح يتكرر الكود، لكنه يتكرر حسب شرط.

"""
# Forمثال على :

for i in range(6):
        
   print(i)
    
# whil مثال على :

for i in range(10):
    if i == 9:
        break
    print(i)

    """
   * نستخدم break لايقاف التكرار 
   * نستخدم continue لتخطي تكرار معين 
    """
