# list (القوائم):
"""
هي مجموعة من العناصر مثل الأرقام الكلمات ، وغيرها تخزن في متغير واحد فقط 
فبدلاً من كتابة كل عنصر في متغير لوحده يتم كتابتها معاً 
في متغير واحد فقط وبالتالي تسهل العمل على المستخدم ويقوم باستعمالها 
عندما يرغب بأن يحتفظ بأكثر من قيمة معاً


** الموجودة في باقي اللغات Arrays بدلا من  Listتسخدم  python في لغة
"""
# for example :
studant_name = ["Ahmed","Ali","Khaled"]

"""
:القائمة السابقة تحتوي على 

* تحتوي على 3 عناصر
* (,)كل عنصر مفصول عن العنصر الاخر بواسطة 
* ("") كل عنصر من هذه العناصر موجود بين علامتي تنصيص 
"""
# مميزات List :
"""
مرتبة حيث انه يمكن الوصول إلى أي عنصر بواسطة رقمه والترقيم أو الترتيب يبدأ من الصفر وليس من الواحد* 

قابلة للتعديل حيث انه يمكن إضافة أو حذف عنصر فيها أو التعديل على عنصر كتغيير اسمه أو ترتيبه مثلاً*

ممكن أن تحتوي على أنواع مختلفة من البيانات وليس نوع واحد فقط مثل الرقم ،النص*

"""
