# Input & Output (الادخال والاخراج):
"""
Input (المدخلات): يعني إدخال معلومات وأخذها من المستخدم (زي الاسم، الرقم، كلمة السر).

Output (المخرجات): يعني طباعة معلومات على الشاشة.

"""
"""
. Output ( printالإخراج باستخدام ):

هي الدالة اللي بتطبع معلومات للمستخدم

"""
# Example :

print ("Hello Everyone")

"""
. Input – الإدخال باستخدام input()

هي الدالة التي تأخذ ما يكتبه المستخدم .

"""
# ملاحظة
#دائما يرجع نص ولو كتب المستخدم رقم عليه تحويله اذا اراد استخدامه كرقم input
 
# File Handling :
# هو عملية إدارة الملفات ، وتشمل فتح الملفات، وقراءتها، وكتابتها، والتعديل عليها

"""
  وهو يُستخدم لتخزين البيانات أو استرجاعها من ملفات خارجية، مثل ملفات  
   مما يساعد على حفظ المعلومات والتعامل معها بطريقة منظمة داخل البرنامج, txt 
   
"""
# أوضاع فتح الملفات في بايثون (File Modes): 

"""
"r"	: قراءة فقط / الملف يجب أن يكون موجودًا
"w" :	كتابة / ينشئ ملفًا جديدًا أو يمسح الموجود ويكتب من جديد
"a" :	إضافة / يضيف في نهاية الملف دون حذف الموجود
"r+" :	قراءة وكتابة / الملف يجب أن يكون موجودًا
"w+" :	كتابة وقراءة / يمسح الموجود ثم يكتب ويقرأ
"a+" :	إضافة وقراءة / يضيف في نهاية الملف ويمكن قراءته

"""

