# Try_Except: JAVA,C++ :في لغات تانية مثل  Try_catchهو البديل في بايثون ل 

"""
تستخدم لمعالجة الأخطاء التي قد تحدث أثناء تنفيذ الكود 
ومنع البرنامج من التوقف المفاجئ عند حدوث الخطأ

"""
"""
لماذا نستخدمها (Try_Except) ?
. لحماية البرنامج من التلف والانهيار
. يقوم بالتعامل مع الأخطاء الغير متوقعة والمفاجئة
. تقديم رسائل مفهومة للمستخدم لفهم الخطأ
. معالجة أنواع متعددة من الأخطاء

"""

"""
## مصطلحات مهمة :
Try: نضع داخله الكود الذي قد يسبب خطأ

except: نضع داخله الكود الذي سيتم تنفيذه إذا حدث الخطأ

else: يتم تنفيذه فقط إذا لم يحدث خطأ

finally: يتم تنفيذه دائمًا سواء حدث خطأ أو لم يحدث



"""